---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetPropertyUInt64.Value
source: html/345da858-840f-ce76-0b6f-b0ba29246997.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyUInt64.Value Property

Get the value of the property.

## Syntax (C#)
```csharp
public ulong Value { get; }
```